app/views/homes/index.html.erb

				<% no = 0 %>
				<% teamhasstudent = Teamhasstudent.where(:team_id => team.id) %>
---
SELECT "teamhasstudents".* FROM "teamhasstudents" WHERE "teamhasstudents"."team_id" = $1  [["team_id", 1]]