app/controllers/homes_controller.rb

SELECT "teamevaluations".* FROM "teamevaluations"
SELECT "students".* FROM "students" ORDER BY total DESC
SELECT "teamhasstudents".* FROM "teamhasstudents" WHERE "teamhasstudents"."team_id" = $1  [["team_id", 1]]
SELECT "teams".* FROM "teams"
---
  def index
  	 @te = Teamevaluation.all
  	 @ths = Teamhasstudent.all
  	 @teams = Team.all

SELECT "teamevaluations".* FROM "teamevaluations" ORDER BY "teamevaluations"."total" DESC
SELECT "students".* FROM "students" ORDER BY "students"."total" DESC
---
  def results
  	@teres = Teamevaluation.order(total: :desc)
  	@stures = Student.order(total: :DESC)