app/controllers/sessions_controller.rb

  def login
  	user = User.find_by(email: params[:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nyeinchansulwin.2011@gmail.com"], ["LIMIT", 1]]