app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "students" SET "pskill" = $1, "teamwork" = $2, "tskill" = $3, "documentation" = $4, "innovation" = $5, "efforts" = $6, "engproficiency" = $7, "total" = $8, "updated_at" = $9 WHERE "students"."id" = $10
---
	def individualevaluation
		student = Student.find(params[:stuid])
		student.pskill = student.pskill.to_i +  params[:pskill].to_i
		student.teamwork = student.teamwork.to_i + params[:teamwork].to_i
		student.tskill = student.tskill.to_i + params[:tskill].to_i
		student.documentation = student.documentation.to_i + params[:documentation].to_i
		student.innovation = student.innovation.to_i + params[:innovation].to_i
		student.efforts = student.efforts.to_i + params[:efforts].to_i
		student.engproficiency = student.engproficiency.to_i + params[:engproficiency].to_i
		student.total = student.pskill.to_i + student.teamwork.to_i + student.tskill.to_i + student.documentation.to_i + student.innovation.to_i + student.efforts.to_i + student.engproficiency.to_i
		if student.save()