app/controllers/teamevaluations_controller.rb

	def teamevaluation
		te = Teamevaluation.find_by(team_id:params[:teamid])
		te.pskill = te.pskill.to_i +  params[:pskill].to_i
		te.teamwork = te.teamwork.to_i + params[:teamwork].to_i
		te.tskill = te.tskill.to_i + params[:tskill].to_i
		te.documentation = te.documentation.to_i + params[:documentation].to_i
		te.innovation = te.innovation.to_i + params[:innovation].to_i
		te.efforts = te.efforts.to_i + params[:efforts].to_i
		te.engproficiency = te.engproficiency.to_i + params[:engproficiency].to_i
		te.total = te.pskill.to_i + te.teamwork.to_i + te.tskill.to_i + te.documentation.to_i + te.innovation.to_i + te.efforts.to_i + te.engproficiency.to_i
		if te.save()
---
SELECT  "teamevaluations".* FROM "teamevaluations" WHERE "teamevaluations"."team_id" = $1 LIMIT $2  [["team_id", 3], ["LIMIT", 1]]
UPDATE "teamevaluations" SET "pskill" = $1, "teamwork" = $2, "tskill" = $3, "total" = $4, "updated_at" = $5 WHERE "teamevaluations"."id" = $6  [["pskill", 9], ["teamwork", 9], ["tskill", 9], ["total", 27], ["updated_at", "2019-08-28 17:52:45.379897"], ["id", 1]]