app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def signup
  	user = User.new(name:params[:name],email:params[:email],password:params[:password])
	if params[:password] == params[:confirm_password]
		if user.save

SELECT  "users".* FROM "users" WHERE "users"."role" = $1 LIMIT $2  [["role", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def usermanagement
  		@judges = User.where(:role => 2)
  		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 2], ["updated_at", "2019-08-28 10:11:20.842484"], ["id", 1]]
---
  def setjudge
  		user = User.find(params[:uid])
  		user.role = "2"
  		if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 0], ["updated_at", "2019-08-28 10:15:26.792669"], ["id", 1]]
---
  def canceljudge
  		user = User.find(params[:uid])
  		user.role = "0"
  		if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 1], ["updated_at", "2019-08-28 18:31:22.592152"], ["id", 7]]
---
  def setadmin
  		user = User.find(params[:uid])
  		user.role = "1"
  		if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 0], ["updated_at", "2019-08-28 18:38:45.764071"], ["id", 7]]
---
  def canceladmin
  		user = User.find(params[:uid])
  		user.role = "0"
  		if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def delusr
  		user = User.find(params[:uid])
  		if user.delete